### 66011212067 พัสพล สุทาธรรม

In [1]:
pip install pandas openpyxl

Requirement already satisfied: pandas in c:\Users\INFORMATICS\Python313\Lib\site-packages (2.3.3)
Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\Users\INFORMATICS\Python313\Lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\Users\INFORMATICS\Python313\Lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\Users\INFORMATICS\Python313\Lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\Users\INFORMATICS\Python313\Lib\site-packages (from pandas) (2025.3)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Requirement already satisfied: six>=1.5 in c:\Users\INFORMATICS\Python313\Lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl

   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   ---------------------------------------- 2/2 [openpyxl]

Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 26.0 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd
data = [['66011201','Rapee',25,22],
        ['66011202','Sppkjai',23,24],
        ['66011203','Rakdee',19,25],
        ['66011204','Chan',21,19],
        ['66011205','Krit',20,18]]
column_name = ['ID', 'Name', 'Midterm', 'Final']
df = pd.DataFrame(data,columns=column_name)
print(df)

         ID     Name  Midterm  Final
0  66011201    Rapee       25     22
1  66011202  Sppkjai       23     24
2  66011203   Rakdee       19     25
3  66011204     Chan       21     19
4  66011205     Krit       20     18

In [3]:
df2 = pd.DataFrame(data)
df2

          0        1   2   3
0  66011201    Rapee  25  22
1  66011202  Sppkjai  23  24
2  66011203   Rakdee  19  25
3  66011204     Chan  21  19
4  66011205     Krit  20  18

In [4]:
df.head(2)

         ID     Name  Midterm  Final
0  66011201    Rapee       25     22
1  66011202  Sppkjai       23     24

In [5]:
df2.head()

          0        1   2   3
0  66011201    Rapee  25  22
1  66011202  Sppkjai  23  24
2  66011203   Rakdee  19  25
3  66011204     Chan  21  19
4  66011205     Krit  20  18

## บันทึกข้อมูลลงไฟล์

In [10]:
file_csv1 = 'Data/student1.csv'
file_csv2 = 'Data/student2.csv'
file_excel1 = 'Data/Student.xlsx'

df.to_csv(file_csv1)
df.to_csv(file_csv2, index=False)
df.to_excel(file_excel1, index=False)

## อ่านข้อมูลจากไฟล์

In [11]:
df_read_csv = pd.read_csv(file_csv2)
df_read_csv.head(2)

         ID     Name  Midterm  Final
0  66011201    Rapee       25     22
1  66011202  Sppkjai       23     24

In [12]:
df_read_excel = pd.read_excel(file_excel1)
df_read_excel

         ID     Name  Midterm  Final
0  66011201    Rapee       25     22
1  66011202  Sppkjai       23     24
2  66011203   Rakdee       19     25
3  66011204     Chan       21     19
4  66011205     Krit       20     18

## ต้องการแค่บาง คอลัม

In [15]:
col_name = ['ID', 'Name', 'Final']
df2 = pd.read_csv(file_csv2, usecols=col_name)
df2.head()

         ID     Name  Final
0  66011201    Rapee     22
1  66011202  Sppkjai     24
2  66011203   Rakdee     25
3  66011204     Chan     19
4  66011205     Krit     18

## ดึงข้อมูลมาแค่ที่ต้องการ

In [ ]:
df3 = pd.read_csv(file_csv2, usecols=col_name, nrows=4) # ดึงข้อมูล 4 ชุด
df3

         ID     Name  Final
0  66011201    Rapee     22
1  66011202  Sppkjai     24
2  66011203   Rakdee     25
3  66011204     Chan     19

In [17]:
df4 = pd.read_csv(file_csv2, usecols=col_name, skiprows=[1,3])
df4.head()

         ID     Name  Final
0  66011202  Sppkjai     24
1  66011204     Chan     19
2  66011205     Krit     18

## ข้อมูลทางสถิติ

In [18]:
df = pd.read_csv(file_csv2)
df.describe()

                 ID    Midterm     Final
count  5.000000e+00   5.000000   5.00000
mean   6.601120e+07  21.600000  21.60000
std    1.581139e+00   2.408319   3.04959
min    6.601120e+07  19.000000  18.00000
25%    6.601120e+07  20.000000  19.00000
50%    6.601120e+07  21.000000  22.00000
75%    6.601120e+07  23.000000  24.00000
max    6.601120e+07  25.000000  25.00000

In [19]:
print(f"Mean={df.Final.mean()}\nSD={df.Final.std()}")
print(f"Max={df.Final.max()}\nMin={df.Final.min()}")
print(f"Sum={df.Final.sum()}")

Mean=21.6
SD=3.0495901363953815
Max=25
Min=18
Sum=108

In [21]:
df.ID[1:4]

1    66011202
2    66011203
3    66011204
Name: ID, dtype: int64

In [22]:
df[1:4]

         ID     Name  Midterm  Final
1  66011202  Sppkjai       23     24
2  66011203   Rakdee       19     25
3  66011204     Chan       21     19

In [23]:
df.loc[(df.Midterm<=20)]

         ID    Name  Midterm  Final
2  66011203  Rakdee       19     25
4  66011205    Krit       20     18

In [26]:
df.at[1,'Midterm']
df.head(3)

         ID     Name  Midterm  Final
0  66011201    Rapee       25     22
1  66011202  Sppkjai       23     24
2  66011203   Rakdee       19     25

In [27]:
new_data = [['6601206','Sakon',17,20],['6601207','Yaya',22,20]]
new_df = pd.DataFrame(new_data, columns=column_name)
new_df.head()

        ID   Name  Midterm  Final
0  6601206  Sakon       17     20
1  6601207   Yaya       22     20

## ignore_index=True จะเรียงลำดับให้

In [32]:
df2 = pd.concat([df, new_df], ignore_index=True)
df2

         ID     Name  Midterm  Final
0  66011201    Rapee       25     22
1  66011202  Sppkjai       23     24
2  66011203   Rakdee       19     25
3  66011204     Chan       21     19
4  66011205     Krit       20     18
5   6601206    Sakon       17     20
6   6601207     Yaya       22     20

In [35]:
df3 = df2.drop(columns=['Final'])
df3.head(2)

         ID     Name  Midterm
0  66011201    Rapee       25
1  66011202  Sppkjai       23

## สามารถ Query ได้เหมือน database เลย

In [36]:
df4 = df2.query('Midterm < 20')
df4

         ID    Name  Midterm  Final
2  66011203  Rakdee       19     25
5   6601206   Sakon       17     20

In [37]:
df5 = df2[df2.Midterm > 20]
df5

         ID     Name  Midterm  Final
0  66011201    Rapee       25     22
1  66011202  Sppkjai       23     24
3  66011204     Chan       21     19
6   6601207     Yaya       22     20